---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.RailSupportsLayout.AlignWithRailingPosts
enum: Autodesk.Revit.DB.Architecture.RailSupportsLayout
source: html/58c35d10-0327-cea3-18a3-6ee3db6ddb4c.htm
---
# Autodesk.Revit.DB.Architecture.RailSupportsLayout.AlignWithRailingPosts

The rail supports are laid out aligned with the railing posts.